УТ_для_edt/src/DataProcessors/смартОприходованиеГарантийныхЗапчастей/смартОприходованиеГарантийныхЗапчастей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>смартОприходованиеГарантийныхЗапчастей</name>
  <comment>// смарт:ММ #044 224 137 26.11.2020</comment>
  <tabularSections>
    <name>Запчасти</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Отметка</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОжидается</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПришло</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерЗаявки</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаявкаНаГарантийныйРемонт</name>
      <type>
        <types>DocumentRef.смартЗаявкаНаГарантийныйРемонт</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПозиции</name>
      <comment>ИД строки из табличной части ЗаполняетсяСпециалистомПоПретензиям</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИДСтрокиЗаполняетсяИнженером</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

УТ_для_edt/src/Enums/смартСтатусыПоГарантииПолучение/смартСтатусыПоГарантииПолучение.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>смартСтатусыПоГарантииПолучение</name>
  <comment>//смарт:ММ #044 137 20.07.2020</comment>
  <enumValues>
    <name>Компенсация</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетсяПоступление</name>
    <comment>//смарт:ММ #010 137</comment>
  </enumValues>
  <enumValues>
    <name>ПолученоОтПоставщика</name>
    <comment>//смарт:ММ #010 137</comment>
  </enumValues>
  <enumValues>
    <name>ПеремещеноНаДругиеЦели</name>
    <comment>//смарт:ММ 702 14.11.2021</comment>
  </enumValues>
  <enumValues>
    <name>ВозвращеноПоНазначению</name>
    <comment>//смарт:ММ 702 14.11.2021</comment>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ТипыОперацийВводаОстатков/ТипыОперацийВводаОстатков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыОперацийВводаОстатков</name>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМКОформлениюОтчетовОРозничныхПродажах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВАвтономныхКассахККМПоРозничнойВыручке</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВКассах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПередПоставщиками</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиЗадолженностиПодотчетников</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНаБанковскихСчетах</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамКлиентов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоАвансамПоставщикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоАвансам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасчетовМеждуОрганизациямиПоРеализациям</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиСобственныхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПереданныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТоваровПолученныхНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПерерасходыПодотчетныхСредств</name>
  </enumValues>
  <enumValues>
    <name>ДенежныеСредстваКПоступлениюОтЭквайера</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПереданнойКлиентам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВозвратнойТарыПринятойОтПоставщиков</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеАдресногоХраненияОстатков</name>
  </enumValues>
  <enumValues>
    <name>ПереходНаИспользованиеСкладскихПомещений</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихАктивовПассивов</name>
  </enumValues>
  <enumValues>
    <name>ПодарочныеСертификаты</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНМА</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПоДоговорамКредитовИДепозитов</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиТМЦВЭксплуатации</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхПереработчикам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиМатериаловПереданныхВПроизводство</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихРасходов</name>
  </enumValues>
  <enumValues>
    <name>ФинансовыйРезультатЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОптовыеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>РозничныеПродажиЗаПрошлыеПериоды</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиАрендованныхОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаНаБалансе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПредметовЛизингаЗаБалансом</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиВзаиморасчетовПоДоговорамЛизинга</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПереданныхВАрендуОС</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПереданныхВАрендуПредметовЛизингаНаБалансе</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиНДСПоПриобретеннымЦенностям</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиПрочихРасходовУСН</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасходовУСНПоМатериалам</name>
  </enumValues>
  <enumValues>
    <name>ОстаткиРасходовУСНПоТоварам</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ТипыЗапасов/ТипыЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыЗапасов</name>
  <enumValues>
    <name>Товар</name>
  </enumValues>
  <enumValues>
    <name>КомиссионныйТовар</name>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
  </enumValues>
  <enumValues>
    <name>МатериалДавальца</name>
  </enumValues>
  <enumValues>
    <name>ПродукцияДавальца</name>
  </enumValues>
  <enumValues>
    <name>АгентскаяУслуга</name>
  </enumValues>
  <enumValues>
    <name>ТоварНаХраненииСПравомПродажи</name>
    <comment>Товар, принятый на ответственное хранение с целью дальнейшей продажи</comment>
  </enumValues>
  <enumValues>
    <name>СобственныйТоварВПути</name>
  </enumValues>
  <enumValues>
    <name>СобственныйТоварПоНеотфактурованнойПоставке</name>
  </enumValues>
  <enumValues>
    <name>ТоварТребующийПодтвержденияВыпуска</name>
  </enumValues>
  <enumValues>
    <name>ТоварПереданный</name>
  </enumValues>
  <enumValues>
    <name>ТоварНаХраненииСПравомПродажиПереданный</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ТипыПервичныхДокументов/ТипыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыПервичныхДокументов</name>
  <enumValues>
    <name>ПриобретениеУПоставщика</name>
  </enumValues>
  <enumValues>
    <name>РеализацияКлиенту</name>
  </enumValues>
  <enumValues>
    <name>ОплатаПоставщику</name>
  </enumValues>
  <enumValues>
    <name>ОплатаОтКлиента</name>
  </enumValues>
  <enumValues>
    <name>ВнутренняяНакладная</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаЧерезПодотчетноеЛицо</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Enums/ПорядокРасчетов/ПорядокРасчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ПорядокРасчетов</name>
  <enumValues>
    <name>ПоЗаказамНакладным</name>
  </enumValues>
  <enumValues>
    <name>ПоДоговорамКонтрагентов</name>
  </enumValues>
  <enumValues>
    <name>ПоНакладным</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Documents/ПервичныйДокумент/ПервичныйДокумент.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПервичныйДокумент</name>
  <registerRecords>AccumulationRegister.СебестоимостьТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН</registerRecords>
  <registerRecords>AccumulationRegister.ДетализацияПартийТоваровДляНДСиУСН2_4</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерВходящегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВходящегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПервичногоДокумента</name>
    <type>
      <types>EnumRef.ТипыПервичныхДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРегл</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаРасчетов</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокРасчетов</name>
    <type>
      <types>EnumRef.ПорядокРасчетов</types>
    </type>
  </attributes>
</mdclass:Document>

УТ_для_edt/src/Catalogs/ВидыЗапасов/ВидыЗапасов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВидыЗапасов</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗапасов</name>
    <type>
      <types>EnumRef.ТипыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВладелецТовара</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Соглашение</name>
    <type>
      <types>CatalogRef.СоглашенияСПоставщиками</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>РеализацияЗапасовДругойОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЗапасовВладельца</name>
    <type>
      <types>CatalogRef.ВидыЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПередачиТоваров</name>
    <type>
      <types>EnumRef.СпособыПередачиТоваров</types>
    </type>
  </attributes>
  <attributes>
    <name>УстарелоПоставщик</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>УстарелоПредназначение</name>
    <type>
      <types>EnumRef.ТипыПредназначенияВидовЗапасов</types>
    </type>
  </attributes>
  <attributes>
    <name>УстарелоПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>УстарелоМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>УстарелоСделка</name>
    <type>
      <types>CatalogRef.СделкиСКлиентами</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <type>
      <types>CatalogRef.ГруппыФинансовогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыМеждуОрганизациями</types>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>УстарелоНазначение</name>
    <type>
      <types>CatalogRef.Назначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГруппаПродукции</name>
    <type>
      <types>CatalogRef.ГруппыАналитическогоУчетаНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <type>
      <types>CatalogRef.ВидыЦенПоставщиков</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоДубль</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Устаревший</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УТ_для_edt/src/DataProcessors/смартОприходованиеГарантийныхЗапчастей/ObjectModule.bsl
Процедура ЗаполнитьНаСервере() Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка.Номер КАК Номер,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Номенклатура КАК Номенклатура,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Количество КАК Количество,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.ИДСтрокиЗаполняетсяИнженером КАК ИДСтрокиЗаполняетсяИнженером,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка КАК Ссылка,
	|	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.НомерПозиции КАК НомерПозиции
	|ПОМЕСТИТЬ ВТ_Специалист
    |ИЗ
    |	Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяСпециалистомПоПретензиям КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям
    |ГДЕ
    |	смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.СтатусПолучения = &ОжидаетсяПоступление
    |	И смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.ПрямаяПоставка
    |	И смартЗаявкаНаГарантийныйРемонтЗаполняетсяСпециалистомПоПретензиям.Ссылка.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыКассовойСмены.Открыта)
    |;
    |
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВТ_Специалист.Номер КАК НомерЗаявки,
	|	ВТ_Специалист.Номенклатура КАК Номенклатура,
	|	ВТ_Специалист.Количество КАК КоличествоОжидается,
	|	ВЫБОР
	|		КОГДА смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером.НоменклатураУстановленнаяКлиенту = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|			ТОГДА &СкладЗапчастейПодЗаказ
	|		ИНАЧЕ &ОсновнойСклад
	|	КОНЕЦ КАК Склад,
	|	ВТ_Специалист.Ссылка КАК ЗаявкаНаГарантийныйРемонт,
	|	ВТ_Специалист.НомерПозиции КАК НомерПозиции,
	|	ВТ_Специалист.ИДСтрокиЗаполняетсяИнженером КАК ИДСтрокиЗаполняетсяИнженером
	|ИЗ
	|	ВТ_Специалист КАК ВТ_Специалист
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.смартЗаявкаНаГарантийныйРемонт.ЗаполняетсяИнженером КАК смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером
	|		ПО ВТ_Специалист.Ссылка = смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером.Ссылка
	|			И ВТ_Специалист.ИДСтрокиЗаполняетсяИнженером = смартЗаявкаНаГарантийныйРемонтЗаполняетсяИнженером.ИДСтрокиЗаполняетсяИнженером";
	
	Запрос.УстановитьПараметр("ОжидаетсяПоступление", Перечисления.смартСтатусыПоГарантииПолучение.ОжидаетсяПоступление);
	Запрос.УстановитьПараметр("ОсновнойСклад", Справочники.смартПредопределенныеЗначения.ОсновнойСклад.Значение);
	Запрос.УстановитьПараметр("СкладЗапчастейПодЗаказ", Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение);
	
	Запчасти.Загрузить(Запрос.Выполнить().Выгрузить());
	
КонецПроцедуры

Процедура ОприходоватьНаСкладСервер() Экспорт
	
	// 1. Создать ввод остатков
	// 2. Отправляется уведомление по запчастям, которые оприходованы на склад "под заказ" инженеру и прочим адресатам
	// 3. Изменить статус получения на "получено от поставщика" и выполнить запись в таблицу статусов
	// 4. Если оприходовано количество меньшее, чем указано в заявке по строке с запчастью, 
	//		то строку надо разделить в таблице инженера и в таблице специалиста с копированием истории статусов
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.КоличествоПришло КАК КоличествоПришло,
	|	ВТ.КоличествоОжидается КАК КоличествоОжидается,
	|	ВТ.Отметка КАК Отметка,
	|	ВЫРАЗИТЬ(ВТ.ЗаявкаНаГарантийныйРемонт КАК Документ.смартЗаявкаНаГарантийныйРемонт) КАК ЗаявкаНаГарантийныйРемонт,
	|	ВТ.Склад КАК Склад,
	|	ВТ.НомерПозиции КАК НомерПозиции,
	|	ВТ.ИДСтрокиЗаполняетсяИнженером
	|ПОМЕСТИТЬ ТЧ
	|ИЗ
	|	&ВТ КАК ВТ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ.Номенклатура КАК Номенклатура,
	|	ВТ.КоличествоПришло КАК КоличествоПришло,
	|	ВТ.КоличествоОжидается КАК КоличествоОжидается,
	|	ВТ.Отметка КАК Отметка,
	|	ВТ.ЗаявкаНаГарантийныйРемонт КАК ЗаявкаНаГарантийныйРемонт,
	|	ВТ.Склад КАК Склад,
	|	ВТ.ЗаявкаНаГарантийныйРемонт.Организация КАК Организация,
	|	ВТ.НомерПозиции КАК НомерПозиции,
	|	ВТ.ИДСтрокиЗаполняетсяИнженером
	|ИЗ
	|	ТЧ КАК ВТ
	|ГДЕ
	|	ВТ.Отметка
	|ИТОГИ
	|	МАКСИМУМ(Организация)
	|ПО
	|	ЗаявкаНаГарантийныйРемонт,
	|	Склад";
	
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ВТ", Запчасти.Выгрузить());
	
	УстановитьПривилегированныйРежим(Истина);
	
	СкладЗапчастейПодЗаказ = Справочники.смартПредопределенныеЗначения.ОсновнойСкладДляЗапчастейПодЗаказ.Значение;
	
	ТипОперацииОстаткиСобственныхТоваров = Перечисления.ТипыОперацийВводаОстатков.ОстаткиСобственныхТоваров;
	ТекПользователь = ПараметрыСеанса.ТекущийПользователь;
	Подразделение = Справочники.смартПредопределенныеЗначения.ПодразделениеПоЗаявкамНаГарантийныйРемонт.Значение;
	ПродажаОблагаетсяНДС = Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС;
	
	ВалютаРегл = Константы.ВалютаРегламентированногоУчета.Получить();
	//ВалютаУпр = Константы.ВалютаУправленческогоУчета.Получить();
		
	ВыборкаЗаявка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаЗаявка.Следующий() Цикл
		
		НачатьТранзакцию();
		
		ЗаявкаНаГарантийныйРемонт = ВыборкаЗаявка.ЗаявкаНаГарантийныйРемонт;
		
		ЗапросВидЗапасов = Новый Запрос;
		ЗапросВидЗапасов.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ВидыЗапасов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыЗапасов КАК ВидыЗапасов
		|ГДЕ
		|	НЕ ВидыЗапасов.ПометкаУдаления
		|	И ВидыЗапасов.Организация = &Организация
		|	И ВидыЗапасов.ТипЗапасов = &ТипЗапасов";
		
		ЗапросВидЗапасов.УстановитьПараметр("Организация", ВыборкаЗаявка.Организация);
		ЗапросВидЗапасов.УстановитьПараметр("ТипЗапасов", Перечисления.ТипыЗапасов.Товар);
		
		ВыборкаВидЗапасов = ЗапросВидЗапасов.Выполнить().Выбрать();
		
		ВидЗапасов = Неопределено;
		Если ВыборкаВидЗапасов.Следующий() Тогда
			ВидЗапасов = ВыборкаВидЗапасов.Ссылка;
		КонецЕсли;
		
		ВыборкаСклад = ВыборкаЗаявка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаСклад.Следующий() Цикл
			
			ДокументВводОстатков = Документы.ВводОстатков.СоздатьДокумент();
			
			СписокНоменклатуры = "";   // Для рассылки
			МассивНоменклатуры = Новый Массив; // Для рассылки
			МассивСтруктур = Новый Массив; // Для изменения статуса
			
			Выборка = ВыборкаСклад.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Если Выборка.КоличествоПришло = 0 Тогда
					Продолжить;
				КонецЕсли;
				
				НоваяСтрока = ДокументВводОстатков.Товары.Добавить();
				НоваяСтрока.Номенклатура = Выборка.Номенклатура;
				НоваяСтрока.Количество = Выборка.КоличествоПришло;
				НоваяСтрока.КоличествоУпаковок = НоваяСтрока.Количество;
				НоваяСтрока.ВидЗапасов = ВидЗапасов;
				
				Если МассивНоменклатуры.Найти(Выборка.Номенклатура) = Неопределено Тогда
					МассивНоменклатуры.Добавить(Выборка.Номенклатура);
					СписокНоменклатуры = СписокНоменклатуры + ?(ЗначениеЗаполнено(СписокНоменклатуры), ", ", "") + Выборка.Номенклатура;
				КонецЕсли;
				
				СтруктураСтроки = Новый Структура;
				СтруктураСтроки.Вставить("НомерПозиции", Выборка.НомерПозиции);
				СтруктураСтроки.Вставить("КоличествоПришло", Выборка.КоличествоПришло);
				СтруктураСтроки.Вставить("ИДСтрокиЗаполняетсяИнженером", Выборка.ИДСтрокиЗаполняетсяИнженером);
				МассивСтруктур.Добавить(СтруктураСтроки);
				
			КонецЦикла;				
			
			Если ДокументВводОстатков.Товары.Количество() > 0 Тогда
				
				ДокументВводОстатков.Организация 	= ВыборкаЗаявка.Организация;
				ДокументВводОстатков.ТипОперации 	= ТипОперацииОстаткиСобственныхТоваров;
				ДокументВводОстатков.Склад 			= ВыборкаСклад.Склад;
				ДокументВводОстатков.Ответственный 	= ТекПользователь;
				ДокументВводОстатков.Подразделение 	= Подразделение;
				ДокументВводОстатков.ЦенаВключаетНДС 			= Истина;
				ДокументВводОстатков.ОтражатьВОперативномУчете 	= Истина;
				ДокументВводОстатков.ВидДеятельностиНДС 		= ПродажаОблагаетсяНДС;				
				ДокументВводОстатков.ОтражатьСебестоимость 		= Истина;	
				
				Комментарий = Документы.смартЗаявкаНаГарантийныйРемонт.ПолучитьТекстКомментарияКДокументу(ЗаявкаНаГарантийныйРемонт);
				
				ДокументВводОстатков.Комментарий = Комментарий;
				
				ДокументВводОстатков.Партия = СоздатьПервичныйДокумент(ЗаявкаНаГарантийныйРемонт, Комментарий);
				Если НЕ ЗначениеЗаполнено(ДокументВводОстатков.Партия) Тогда
					ДокументВводОстатков = Неопределено;
					Продолжить;
				КонецЕсли;
				
				ДокументВводОстатков.Валюта = ВалютаРегл;
				
				ДатаПроверки = ТекущаяДатаСеанса();
				Если РасчетСебестоимостиПовтИсп.ПартионныйУчетВерсии21(ДатаПроверки) Тогда
					ДокументВводОстатков.ВводОстатков22 = Истина;
				КонецЕсли;
				
				ДокументВводОстатков.Дата = ТекущаяДата();
				
				Попытка
					ДокументВводОстатков.Записать(РежимЗаписиДокумента.Проведение);
					
					// Изменить статус в заявке
					Для Каждого СтруктураСтроки Из МассивСтруктур Цикл
						Успех = ИзменитьСтатусВЗаявке(ЗаявкаНаГарантийныйРемонт, СтруктураСтроки, ДокументВводОстатков.Ссылка);
					КонецЦикла;

					
					// Отправить уведомление
					Если ВыборкаСклад.Склад = СкладЗапчастейПодЗаказ Тогда
						смартОбработкаПодписокНаСобытия.ОтправитьУведомлениеПриходНаСкладЗапчастейПодЗаказ(ЗаявкаНаГарантийныйРемонт, СписокНоменклатуры);
					КонецЕсли;
					
					ЗафиксироватьТранзакцию();
				Исключение
					СинонимДокумента = ДокументВводОстатков.Метаданные().Синоним;
					ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
					|" + ОписаниеОшибки() + "
					|Документ не создан.");
					ОтменитьТранзакцию();
				КонецПопытки;				
				
			КонецЕсли;
		КонецЦикла; // Склад
		
	КонецЦикла; // Заявка 
	
	УстановитьПривилегированныйРежим(Ложь);
	
	//ОтправитьУведомления();
	
КонецПроцедуры

&НаСервере
Функция СоздатьПервичныйДокумент(ЗаявкаНаГарантийныйРемонт, Комментарий)
	
	ДокументПервичныйДокумент = Документы.ПервичныйДокумент.СоздатьДокумент();
	
	ДокументПервичныйДокумент.ТипПервичногоДокумента = Перечисления.ТипыПервичныхДокументов.ВнутренняяНакладная;
	ДокументПервичныйДокумент.Дата 			= ТекущаяДата();
	ДокументПервичныйДокумент.Номер 		= ЗаявкаНаГарантийныйРемонт.Номер;
	ДокументПервичныйДокумент.Организация 	= ЗаявкаНаГарантийныйРемонт.Организация;
	ДокументПервичныйДокумент.Комментарий  	= Комментарий;
	ДокументПервичныйДокумент.ПорядокРасчетов = Перечисления.ПорядокРасчетов.ПоНакладным;
	
	СинонимДокумента = ДокументПервичныйДокумент.Метаданные().Синоним;
	
	Попытка
		ДокументПервичныйДокумент.Записать(РежимЗаписиДокумента.Проведение);
		Возврат ДокументПервичныйДокумент.Ссылка;
	Исключение
		СинонимДокумента = ДокументПервичныйДокумент.Метаданные().Синоним;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + СинонимДокумента + """ по причине
		|" + ОписаниеОшибки() + "
		|Документ не создан.");
		Возврат Неопределено;
	КонецПопытки;
	
КонецФункции

&НаСервере
Функция ИзменитьСтатусВЗаявке(ЗаявкаНаГарантийныйРемонт, Выборка, ВводОстатков)
	
	Успех = Ложь;
	
	Если НЕ ЗначениеЗаполнено(ЗаявкаНаГарантийныйРемонт) Тогда
		Возврат Успех;
	КонецЕсли;
	
	ДокОбъект = ЗаявкаНаГарантийныйРемонт.ПолучитьОбъект();
	
	Отбор = Новый Структура;
	Отбор.Вставить("НомерПозиции", Выборка.НомерПозиции);
	НайденныеСтроки = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.НайтиСтроки(Отбор);
	Если НайденныеСтроки.Количество() = 0 Тогда
		Возврат Успех;
	КонецЕсли;
	
	СтрокаСпециалист = НайденныеСтроки[0];
	
	УстанавливаемыйСтатус = Перечисления.смартСтатусыПоГарантииПолучение.ПолученоОтПоставщика;
	
	Если СтрокаСпециалист.Количество = Выборка.КоличествоПришло Тогда
		
		СтрокаСпециалист.СтатусПолучения = УстанавливаемыйСтатус;
		
		НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(ДокОбъект, Выборка.НомерПозиции, УстанавливаемыйСтатус); 				
		НоваяСтрокаСтатус.НомерПозиции 			= Выборка.НомерПозиции;
		НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= ТекущаяДата();
		НоваяСтрокаСтатус.Статус 				= УстанавливаемыйСтатус;
		НоваяСтрокаСтатус.ДокументДвижения 		= ВводОстатков;
		
	ИначеЕсли СтрокаСпециалист.Количество > Выборка.КоличествоПришло Тогда
		
		// Разбить строки в документе с копированием истории статусов
		
		// Таблица Инженера
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИДСтрокиЗаполняетсяИнженером", Выборка.ИДСтрокиЗаполняетсяИнженером);
		
		НайденныеСтрокиИнженер = ДокОбъект.ЗаполняетсяИнженером.НайтиСтроки(Отбор);
		Если НайденныеСтрокиИнженер.Количество() = 0 Тогда
			// Сюда не должно попасть!
			Возврат Успех;
		КонецЕсли;

		СтрокаИнженер = НайденныеСтрокиИнженер[0];
		// Добавляется новая строка на непринятое количество
		НоваяСтрокаИнженер = ДокОбъект.ЗаполняетсяИнженером.Вставить(СтрокаИнженер.НомерСтроки);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаИнженер, СтрокаИнженер);
		
		НоваяСтрокаИнженер.Количество = СтрокаИнженер.Количество - Выборка.КоличествоПришло;
		
		СтрокаИнженер.Количество = Выборка.КоличествоПришло; // В старой строке количество устанавливается то, которое пришло
		
		НоваяСтрокаИнженер.ИДСтрокиЗаполняетсяИнженером = ДокОбъект.ПолучитьСледующийИДСтроки();
		
		// Таблица Специалиста
		
		НоваяСтрокаСпециалист = ДокОбъект.ЗаполняетсяСпециалистомПоПретензиям.Вставить(СтрокаСпециалист.НомерСтроки);
		ЗаполнитьЗначенияСвойств(НоваяСтрокаСпециалист, СтрокаСпециалист);
		НоваяСтрокаСпециалист.ИДСтрокиЗаполняетсяИнженером = НоваяСтрокаИнженер.ИДСтрокиЗаполняетсяИнженером;
		НоваяСтрокаСпециалист.Количество = НоваяСтрокаИнженер.Количество; // Разница
		НоваяСтрокаСпециалист.НомерПозиции = ДокОбъект.ПолучитьСледующийНомерПозиции();
		
		СтрокаСпециалист.Количество = СтрокаИнженер.Количество; // Пришло
		
		// Зависимые таблицы
		
		Отбор = Новый Структура;
		Отбор.Вставить("НомерПозиции", СтрокаСпециалист.НомерПозиции);
		
		НайденныеСтрокиСтатус = ДокОбъект.Статусы.НайтиСтроки(Отбор);		
		Для Каждого СтрокаСтатус Из НайденныеСтрокиСтатус Цикл
			НоваяСтрокаСтатус = ДокОбъект.Статусы.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаСтатус, СтрокаСтатус);
			НоваяСтрокаСтатус.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
		КонецЦикла;
		
		НайденныеСтрокиИсторияРешений = ДокОбъект.ИсторияРешенийПоставщика.НайтиСтроки(Отбор);
		Для Каждого СтрокаИстория Из НайденныеСтрокиИсторияРешений Цикл
			НоваяСтрокаИстория = ДокОбъект.ИсторияРешенийПоставщика.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаИстория, СтрокаИстория);
			НоваяСтрокаИстория.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
		КонецЦикла;
		
		НайденныеСтрокиДопДействия = ДокОбъект.ДополнительныеДействия.НайтиСтроки(Отбор);
		Для Каждого СтрокаДопДействия Из НайденныеСтрокиДопДействия Цикл
			НоваяСтрокаДопДействия = ДокОбъект.ДополнительныеДействия.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрокаДопДействия, СтрокаДопДействия);
			НоваяСтрокаДопДействия.НомерПозиции = НоваяСтрокаСпециалист.НомерПозиции;
		КонецЦикла;
		
		
		// Теперь можно поменять статус у строки с количеством, которое пришло
		СтрокаСпециалист.СтатусПолучения = УстанавливаемыйСтатус;
		
		НоваяСтрокаСтатус = смартОбщегоНазначения.ПолучитьСтрокуСоСтатусом(ДокОбъект, Выборка.НомерПозиции, УстанавливаемыйСтатус); 				
		НоваяСтрокаСтатус.НомерПозиции 			= Выборка.НомерПозиции;
		НоваяСтрокаСтатус.ДатаИзмененияСтатуса 	= ТекущаяДата();
		НоваяСтрокаСтатус.Статус 				= УстанавливаемыйСтатус;
		НоваяСтрокаСтатус.ДокументДвижения 		= ВводОстатков;

		Успех = Истина;
	Иначе 
		// Пришло больше чем в заявке?
		Возврат Успех;
	КонецЕсли;
	
	СинонимДокумента = ДокОбъект.Метаданные().Синоним;
	
	Попытка 
		ДокОбъект.Записать(РежимЗаписиДокумента.Проведение);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Изменен документ """ + ДокОбъект.Ссылка + """", ДокОбъект.Ссылка);
		Успех = Истина;
	Исключение
		//ДокОбъект.Записать(РежимЗаписиДокумента.Запись);
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось провести документ """ + ДокОбъект.Ссылка + """ по причине
		|" + ОписаниеОшибки(), ДокОбъект.Ссылка);
	КонецПопытки;

	
	Возврат Успех;
	
КонецФункции
